### Plan for staging
Plan: 1 to add, 0 to change, 1 to destroy.

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # module.customer_analytics.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:545209064596:task-definition/customer-analytics:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:545209064596:task-definition/customer-analytics" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment      = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_TRACE_SAMPLE_RATE"
                            value = "0.5"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "0.0.1-1" -> "0.0.2-3"
                        },
                        {
                            name  = "cloud.aws.credentials.instanceProfile"
                            value = "true"
                        },
                        # (5 unchanged elements hidden)
                    ]
                  ~ image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-customer-analytics:0.0.1-1" -> "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-customer-analytics:0.0.2-3"
                  - mountPoints      = []
                    name             = "customer-analytics"
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints  = []
                    name         = "datadog-agent"
                  - volumesFrom  = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - environment           = []
                  - mountPoints           = []
                    name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - volumesFrom           = []
                    # (6 unchanged attributes hidden)
                },
              ~ {
                  - mountPoints      = []
                    name             = "envoy"
                  - portMappings     = []
                  - volumesFrom      = []
                    # (9 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "customer-analytics" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      ~ tags                     = {
            "service" = "customer-analytics"
          ~ "version" = "0.0.1-1" -> "0.0.2-3"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.1-1" -> "0.0.2-3"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>
